stm32duino/Arduino_Tools/src/genpinmap/Arduino/STM32F378VCHx/PeripheralPins.c
/*
 *******************************************************************************
 * Copyright (c) 2019, STMicroelectronics
 * All rights reserved.
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 * Automatically generated from STM32F378VCHx.xml
 */
#include "Arduino.h"
#include "PeripheralPins.h"

/* =====
 * Note: Commented lines are alternative possibilities which are not used per default.
 *       If you change them, you will have to know what you do
 * =====
 */

//*** ADC ***

#ifdef HAL_ADC_MODULE_ENABLED
WEAK const PinMap PinMap_ADC[] = {
  {PA_0,  ADC1,  STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 0, 0)}, // ADC1_IN0
  {PA_1,  ADC1,  STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 1, 0)}, // ADC1_IN1
  {PA_2,  ADC1,  STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 2, 0)}, // ADC1_IN2
  {PA_3,  ADC1,  STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 3, 0)}, // ADC1_IN3
  {PA_4,  ADC1,  STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 4, 0)}, // ADC1_IN4
  {PA_5,  ADC1,  STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 5, 0)}, // ADC1_IN5
  {PA_6,  ADC1,  STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 6, 0)}, // ADC1_IN6
  {PA_7,  ADC1,  STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 7, 0)}, // ADC1_IN7
  {PB_0,  ADC1,  STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 8, 0)}, // ADC1_IN8
  {PB_0,  ADCSD1,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A6P, 0)}, // SDADC1_AIN6P
  {PB_1,  ADC1,  STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 9, 0)}, // ADC1_IN9
  {PB_1,  ADCSD1,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A5P, 0)}, // SDADC1_AIN5P
  {PB_1,  ADCSD1,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A6M, 0)}, // SDADC1_AIN6M
  {PB_10, ADCSD2,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A0M, 0)}, // SDADC2_AIN0M
  {PB_14, ADCSD3,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A8P, 0)}, // SDADC3_AIN8P
  {PB_15, ADCSD3,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A7P, 0)}, // SDADC3_AIN7P
  {PB_15, ADCSD3,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A8M, 0)}, // SDADC3_AIN8M
  {PC_0,  ADC1,  STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 10, 0)}, // ADC1_IN10
  {PC_1,  ADC1,  STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 11, 0)}, // ADC1_IN11
  {PC_2,  ADC1,  STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 12, 0)}, // ADC1_IN12
  {PC_3,  ADC1,  STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 13, 0)}, // ADC1_IN13
  {PC_4,  ADC1,  STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 14, 0)}, // ADC1_IN14
  {PC_5,  ADC1,  STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 15, 0)}, // ADC1_IN15
  {PD_8,  ADCSD3,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A6P, 0)}, // SDADC3_AIN6P
  {PD_9,  ADCSD3,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A5P, 0)}, // SDADC3_AIN5P
  {PD_9,  ADCSD3,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A6M, 0)}, // SDADC3_AIN6M
  {PD_10, ADCSD3,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A4P, 0)}, // SDADC3_AIN4P
  {PD_11, ADCSD3,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A3P, 0)}, // SDADC3_AIN3P
  {PD_11, ADCSD3,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A4M, 0)}, // SDADC3_AIN4M
  {PD_12, ADCSD3,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A2P, 0)}, // SDADC3_AIN2P
  {PD_13, ADCSD3,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A1P, 0)}, // SDADC3_AIN1P
  {PD_13, ADCSD3,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A2M, 0)}, // SDADC3_AIN2M
  {PD_14, ADCSD3,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A0P, 0)}, // SDADC3_AIN0P
  {PD_15, ADCSD3,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A0M, 0)}, // SDADC3_AIN0M
  {PE_7,  ADCSD1,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A3P, 0)}, // SDADC1_AIN3P
  {PE_7,  ADCSD1,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A4M, 0)}, // SDADC1_AIN4M
  {PE_7,  ADCSD2,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A5P, 0)}, // SDADC2_AIN5P
  {PE_7,  ADCSD2,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A6M, 0)}, // SDADC2_AIN6M
  {PE_8,  ADCSD1,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A8P, 0)}, // SDADC1_AIN8P
  {PE_8,  ADCSD2,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A8P, 0)}, // SDADC2_AIN8P
  {PE_9,  ADCSD1,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A7P, 0)}, // SDADC1_AIN7P
  {PE_9,  ADCSD1,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A8M, 0)}, // SDADC1_AIN8M
  {PE_9,  ADCSD2,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A7P, 0)}, // SDADC2_AIN7P
  {PE_9,  ADCSD2,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A8M, 0)}, // SDADC2_AIN8M
  {PE_10, ADCSD1,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A2P, 0)}, // SDADC1_AIN2P
  {PE_11, ADCSD1,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A1P, 0)}, // SDADC1_AIN1P
  {PE_11, ADCSD1,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A2M, 0)}, // SDADC1_AIN2M
  {PE_11, ADCSD2,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A4P, 0)}, // SDADC2_AIN4P
  {PE_12, ADCSD1,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A0P, 0)}, // SDADC1_AIN0P
  {PE_12, ADCSD2,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A3P, 0)}, // SDADC2_AIN3P
  {PE_12, ADCSD2,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A4M, 0)}, // SDADC2_AIN4M
  {PE_13, ADCSD1,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A0M, 0)}, // SDADC1_AIN0M
  {PE_13, ADCSD2,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A2P, 0)}, // SDADC2_AIN2P
  {PE_14, ADCSD2,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A1P, 0)}, // SDADC2_AIN1P
  {PE_14, ADCSD2,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A2M, 0)}, // SDADC2_AIN2M
  {PE_15, ADCSD2,STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, A0P, 0)}, // SDADC2_AIN0P
  {NC,    NP,    0}
};
#endif

//*** DAC ***

#ifdef HAL_DAC_MODULE_ENABLED
WEAK const PinMap PinMap_DAC[] = {
  {PA_4,  DAC1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 1, 0)}, // DAC1_OUT1
  {PA_5,  DAC1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 2, 0)}, // DAC1_OUT2
  {PA_6,  DAC2, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 1, 0)}, // DAC2_OUT1
  {NC,    NP,    0}
};
#endif

//*** I2C ***

#ifdef HAL_I2C_MODULE_ENABLED
WEAK const PinMap PinMap_I2C_SDA[] = {
  {PA_10, I2C2, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C2)},
  {PA_14, I2C1, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C1)},
  {PB_7,  I2C1, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C1)},
  {PB_9,  I2C1, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C1)},
  {PF_0,  I2C2, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C2)},
  {NC,    NP,    0}
};
#endif

#ifdef HAL_I2C_MODULE_ENABLED
WEAK const PinMap PinMap_I2C_SCL[] = {
  {PA_9,  I2C2, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C2)},
  {PA_15, I2C1, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C1)},
  {PB_6,  I2C1, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C1)},
  {PB_8,  I2C1, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C1)},
  {PF_1,  I2C2, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C2)},
  {PF_6,  I2C2, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C2)},
  {NC,    NP,    0}
};
#endif

